# Practice
**Movie Recommendation** 데이터를 다시 한 번 import 해볼게요!

In [1]:
import pandas as pd

movies = pd.read_csv("movies.csv",index_col="movie_id")
users = pd.read_csv("users.csv",index_col = "user_id")
ratings = pd.read_csv("ratings.csv", index_col = "id")

In [2]:
movies.head()

                                       title                        genres
movie_id
1                           Toy Story (1995)   Animation|Children's|Comedy
2                             Jumanji (1995)  Adventure|Children's|Fantasy
3                    Grumpier Old Men (1995)                Comedy|Romance
4                   Waiting to Exhale (1995)                  Comedy|Drama
5         Father of the Bride Part II (1995)                        Comedy

In [3]:
users.head()

        gender  age  occupation    zip
user_id
1            F    0          10  48067
2            M   50          16  70072
3            M   20          15  55117
4            M   40           7  02460
5            M   20          20  55455

In [4]:
ratings.head()

           user  movie  rating
id
2783_1253  2783   1253       5
2783_589   2783    589       5
2783_1270  2783   1270       4
2783_1274  2783   1274       4
2783_741   2783    741       5

## 문제 1
movies의 title이란 컬럼에는 영화 이름 뒤에 개봉연도가 적혀있는데요.<br>
개봉연도, 괄호 등의 텍스트를 지우고 순수한 영화 이름 정보만 추출하여 "year"이란 컬럼에 집어넣어보세요.<br>

In [3]:
movies['year'] =

In [4]:
# 정답은 아래와 같습니다. 
movies.head()

,title,genres,year
movie_id,,,
1,Toy Story (1995),Animation|Children's|Comedy,Toy Story
2,Jumanji (1995),Adventure|Children's|Fantasy,Jumanji
3,Grumpier Old Men (1995),Comedy|Romance,Grumpier Old Men
4,Waiting to Exhale (1995),Comedy|Drama,Waiting to Exhale
5,Father of the Bride Part II (1995),Comedy,Father of the Bride Part II

## 문제2
movies의 genres 컬럼을 잘 살펴보시면, 여러 장르가 묶여있습니다. 각각의 장르는 "|"라는 구분자로 구분되어있습니다.<br>
각각의 장르를 쪼개서 서로 다른 컬럼에 집어넣고 genre라는 이름의 데이터프레임으로 저장해보세요. 

hints
* .split()
* expand=True

In [6]:
genre =

In [8]:
# 정답은 아래와 같습니다.
genre.head()

                  0           1        2     3     4     5
movie_id
1         Animation  Children's   Comedy  None  None  None
2         Adventure  Children's  Fantasy  None  None  None
3            Comedy     Romance     None  None  None  None
4            Comedy       Drama     None  None  None  None
5            Comedy        None     None  None  None  None

## 문제3
모든 정보를 하나의 데이터프레임으로 합쳐보고 싶습니다. <br>
ratings에 users와 movies 데이터프레임을 merge 해주세요. (inner)

In [10]:
# 원본 moives 데이터프레임을 다시한번 만들어주시고..
movies = pd.read_csv("movies.csv",index_col="movie_id")

In [11]:
merged = (
            ratings.merge(      ) ## users를 merge 해봅시다  
                   .merge(      ) ## movies를 merge 해봅시다
        )

In [12]:
# 정답은 아래와 같습니다.
merged.head()

,user,movie,rating,gender,age,occupation,zip,title,genres
id,,,,,,,,,
2783_1253,2783,1253,5,M,40,17,78750,"Day the Earth Stood Still, The (1951)",Drama|Sci-Fi
2788_1253,2788,1253,4,M,50,1,90049,"Day the Earth Stood Still, The (1951)",Drama|Sci-Fi
2789_1253,2789,1253,4,M,10,4,90025,"Day the Earth Stood Still, The (1951)",Drama|Sci-Fi
2794_1253,2794,1253,5,M,20,2,20036,"Day the Earth Stood Still, The (1951)",Drama|Sci-Fi
2795_1253,2795,1253,4,M,50,13,33710,"Day the Earth Stood Still, The (1951)",Drama|Sci-Fi

## 문제 4
merged에서 각각 영화의 첫 번째 장르만 골라 "1st_genre"라는 컬럼을 새로 만들어보세요.

In [13]:
merged['1st_genre'] =

In [14]:
# 정답은 아래와 같습니다. 
merged.head()

,user,movie,rating,gender,age,occupation,zip,title,genres,1st_genre
id,,,,,,,,,,
2783_1253,2783,1253,5,M,40,17,78750,"Day the Earth Stood Still, The (1951)",Drama|Sci-Fi,Drama
2788_1253,2788,1253,4,M,50,1,90049,"Day the Earth Stood Still, The (1951)",Drama|Sci-Fi,Drama
2789_1253,2789,1253,4,M,10,4,90025,"Day the Earth Stood Still, The (1951)",Drama|Sci-Fi,Drama
2794_1253,2794,1253,5,M,20,2,20036,"Day the Earth Stood Still, The (1951)",Drama|Sci-Fi,Drama
2795_1253,2795,1253,4,M,50,13,33710,"Day the Earth Stood Still, The (1951)",Drama|Sci-Fi,Drama

## 문제5
1st_genre를 기준으로, 평균 평점이 가장 높은 장르를 뽑아보세요.

In [17]:
# 정답은 아래와 같습니다.

1st_genre
Film-Noir    4.191014
Name: rating, dtype: float64

## 문제 6
평균 평점이 가장 높은 영화 5개의 이름을 뽑아보세요. <br>
hint: sort_values()

In [24]:
# 정답은 아래와 같습니다.

title
Ulysses (Ulisse) (1954)                         5.0
Bittersweet Motel (2000)                        5.0
Return with Honor (1998)                        5.0
Sacco and Vanzetti (Sacco e Vanzetti) (1971)    5.0
Angela (1995)                                   5.0
Name: rating, dtype: float64

## 심화문제 7
평균 평점이 5점인 영화가 너무 많습니다. 후기 수가 충분하지 않아서 그런 것 같습니다.<br>
그럼, **1000번 이상 평가된 영화 중**, 평점이 가장 높은 영화 5개의 이름을 찾아보겠습니다.

(1) 영화 제목별(title), 평점별(rating) 후기 개수를 dataframe으로 나타내기 (결측치는 0으로 채우기) <br>
hint. groupby, size(), fillna()

In [ ]:
merged =

In [23]:
# 정답은 아래와 같습니다.
merged.head()

rating                            1     2     3     4     5
title
$1,000,000 Duck (1971)          1.0   3.0   7.0   3.0   0.0
'Night Mother (1986)            2.0   8.0  14.0  13.0   6.0
'Til There Was You (1997)       3.0   6.0   7.0   4.0   2.0
'burbs, The (1989)             16.0  32.0  64.0  34.0  15.0
...And Justice for All (1979)   1.0   6.0  36.0  48.0  24.0

(2) 각 영화별로 후기 수를 나타내는 칼럼(num), 평균 평점을 나타내는 칼럼(mean) 만들기 <br>
hint. assign - 칼럼을 추가하고 추가된 데이터프레임을 리턴하는 메소드

In [ ]:
merged = merged.assign(num =     )
merged = merged.assign(mean =     )

In [33]:
# 정답은 아래와 같습니다. 
merged.head()

rating                            1     2     3     4     5    num      mean
title
$1,000,000 Duck (1971)          1.0   3.0   7.0   3.0   0.0   14.0  2.857143
'Night Mother (1986)            2.0   8.0  14.0  13.0   6.0   43.0  3.302326
'Til There Was You (1997)       3.0   6.0   7.0   4.0   2.0   22.0  2.818182
'burbs, The (1989)             16.0  32.0  64.0  34.0  15.0  161.0  3.000000
...And Justice for All (1979)   1.0   6.0  36.0  48.0  24.0  115.0  3.765217

(3) 1000개 이상의 후기를 가진 영화만 골라 내림차순 정렬하기<br>
hint. sort_values(by = ColName) - 주어진 칼럼 기준으로 오름차순 정렬

In [ ]:
merged =

In [34]:
# 정답은 아래와 같습니다.
merged.head()

rating,1,2,3,4,5,num,mean
title,,,,,,,
"Shawshank Redemption, The (1994)",5.0,13.0,70.0,289.0,779.0,1156.0,4.577855
"Godfather, The (1972)",10.0,24.0,95.0,266.0,787.0,1182.0,4.519459
Schindler's List (1993),11.0,13.0,91.0,310.0,731.0,1156.0,4.502595
Star Wars: Episode IV - A New Hope (1977),9.0,32.0,147.0,416.0,969.0,1573.0,4.464717
Raiders of the Lost Ark (1981),3.0,26.0,125.0,390.0,785.0,1329.0,4.450715

(4) 상위 5개 영화의 제목과 평균 평점 출력하기

In [35]:
merged.iloc[:5]["mean"]

title
Shawshank Redemption, The (1994)             4.577855
Godfather, The (1972)                        4.519459
Schindler's List (1993)                      4.502595
Star Wars: Episode IV - A New Hope (1977)    4.464717
Raiders of the Lost Ark (1981)               4.450715
Name: mean, dtype: float64